-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: step6
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `calendar`
--

DROP TABLE IF EXISTS `calendar`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `calendar` (
  `training` text,
  `강민영` int DEFAULT NULL,
  `고연재` int DEFAULT NULL,
  `김기태` int DEFAULT NULL,
  `김명은` int DEFAULT NULL,
  `김성일` int DEFAULT NULL,
  `김연수` int DEFAULT NULL,
  `노도현` int DEFAULT NULL,
  `류가미` int DEFAULT NULL,
  `박규환` int DEFAULT NULL,
  `박성빈` int DEFAULT NULL,
  `박시형` int DEFAULT NULL,
  `박의용` int DEFAULT NULL,
  `오송화` int DEFAULT NULL,
  `이범규` int DEFAULT NULL,
  `이보라` int DEFAULT NULL,
  `이소윤` int DEFAULT NULL,
  `이여름` int DEFAULT NULL,
  `이지혜` int DEFAULT NULL,
  `이현도` int DEFAULT NULL,
  `임성경` int DEFAULT NULL,
  `임영효` int DEFAULT NULL,
  `임홍선` int DEFAULT NULL,
  `장은희` int DEFAULT NULL,
  `정연우` int DEFAULT NULL,
  `정철우` int DEFAULT NULL,
  `주민석` int DEFAULT NULL,
  `최지혁` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `calendar`
--

LOCK TABLES `calendar` WRITE;
/*!40000 ALTER TABLE `calendar` DISABLE KEYS */;
INSERT INTO `calendar` VALUES ('2022-10-25',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-10-26',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-10-27',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-10-28',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-01',1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-02',1,1,1,1,1,1,1,1,1,0,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-03',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-04',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-07',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-08',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-09',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-10',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-11',1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-14',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-15',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-16',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-17',1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-18',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1),('2022-11-21',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-22',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1),('2022-11-23',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-24',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-25',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-28',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-29',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-11-30',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-05',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1),('2022-12-06',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-07',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-08',1,0,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-09',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-12',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-13',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-14',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-15',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-16',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-19',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-20',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-21',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-22',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2022-12-23',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2023-01-02',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2023-01-03',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2023-01-04',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2023-01-05',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2023-01-06',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1),('2023-01-09',1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1);
/*!40000 ALTER TABLE `calendar` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `manager`
--

DROP TABLE IF EXISTS `manager`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `manager` (
  `name` text,
  `id` text,
  `password` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `manager`
--

LOCK TABLES `manager` WRITE;
/*!40000 ALTER TABLE `manager` DISABLE KEYS */;
INSERT INTO `manager` VALUES ('name','id','password'),('이상복','id','password');
/*!40000 ALTER TABLE `manager` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `messenger`
--

DROP TABLE IF EXISTS `messenger`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `messenger` (
  `이상복_강민영` text,
  `이상복_고연재` text,
  `이상복_김기태` text,
  `이상복_김명은` text,
  `이상복_김성일` text,
  `이상복_김연수` text,
  `이상복_노도현` text,
  `이상복_류가미` text,
  `이상복_박규환` text,
  `이상복_박성빈` text,
  `이상복_박시형` text,
  `이상복_박의용` text,
  `이상복_오송화` text,
  `이상복_이범규` text,
  `이상복_이보라` text,
  `이상복_이소윤` text,
  `이상복_이여름` text,
  `이상복_이재혜` text,
  `이상복_이현도` text,
  `이상복_임성경` text,
  `이상복_임영효` text,
  `이상복_임홍선` text,
  `이상복_장은희` text,
  `이상복_정연우` text,
  `이상복_정철우` text,
  `이상복_주민석` text,
  `이상복_최지혁` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `messenger`
--

LOCK TABLES `messenger` WRITE;
/*!40000 ALTER TABLE `messenger` DISABLE KEYS */;
INSERT INTO `messenger` VALUES ('q','w','e','r','t','y','u','i','o','p','a','s','d','f','g','h','j','k','l','z','x','c','v','b','n','m','qw'),('1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1');
/*!40000 ALTER TABLE `messenger` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `name` text,
  `id` text,
  `password` int DEFAULT NULL,
  `attendance` int DEFAULT NULL,
  `tardy` int DEFAULT NULL,
  `leave_early` int DEFAULT NULL,
  `outing` int DEFAULT NULL,
  `absent` int DEFAULT NULL,
  `round` int DEFAULT NULL,
  `institution` text,
  `location` text,
  `phone` text,
  `period` text,
  `type` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('강민영','q',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('고연재','w',1,44,0,0,0,2,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('김기태','e',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('김명은','r',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('김성일','t',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('김연수','y',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('노도현','u',1,45,0,0,0,1,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('류가미','i',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('박규환','o',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('박성빈','p',1,45,0,0,0,1,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('박시형','a',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('박의용','s',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('오송화','d',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('이범규','f',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('이보라','g',1,43,0,0,0,3,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('이소윤','h',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('이여름','j',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('이지혜','k',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('이현도','l',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('임성경','z',1,44,0,0,0,2,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('임영효','x',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('임홍선','c',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('장은희','v',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('정연우','b',1,45,0,0,0,1,2,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('정철우','n',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('주민석','m',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련'),('최지혁','qw',1,46,0,0,0,0,1,'대한상공회의소 광주 인력개발원','광주광산구','062-940-3520','2022.10.25~2023.05.24','통합심사과정훈련');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-01-09 20:14:22
